# Core development tools (all machines)
brew "asdf"
brew "awscli"
brew "chezmoi"
brew "colima"
brew "coreutils"
brew "direnv"
brew "docker-compose"
brew "findutils"
brew "gh"
brew "gist"
brew "git-extras"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "httpie"
brew "jq"
brew "mas"
brew "moreutils"
brew "pipx"
brew "qemu"
brew "shellcheck"
brew "subversion"
# brew "tailscale"  # Disabled: requires sudo, breaks remote setup. Use Mac App Store version instead.
brew "tree"
brew "wget"

{{- if eq .machine.profile "media" }}
# Video/audio processing (halfmoon only)
brew "ffmpeg"
brew "gifsicle"
{{- end }}

# Modern CLI tools
brew "bat"           # Syntax-highlighted cat
brew "eza"           # Modern ls with git integration
brew "fd"            # Fast find replacement
brew "fzf"           # Fuzzy finder
brew "git-delta"     # Better git diffs
brew "ripgrep"       # Fast grep replacement
brew "zoxide"        # Smarter cd
brew "dust"          # Intuitive du
brew "duf"           # Modern df
brew "procs"         # Modern ps
brew "tldr"          # Simplified man pages
brew "hyperfine"     # Benchmarking tool

# Core applications (all machines)
cask "1password"
cask "1password-cli"
cask "alfred"
cask "figma"
cask "font-inconsolata"
cask "font-montserrat"
cask "font-open-sans"
cask "font-sanchez"
cask "font-source-code-pro"
cask "ghostty"
cask "github"
cask "gmvault"
cask "google-chrome"
cask "google-drive"
cask "grammarly-desktop"
cask "iterm2"
cask "ledger-live"
cask "loom"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "notion"
cask "obsidian"
cask "qfinder-pro"
cask "raycast"
cask "rectangle"
cask "signal"
cask "stats"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"

{{- if eq .machine.profile "media" }}
# Video editing and streaming (halfmoon only)
cask "adobe-creative-cloud"
cask "audio-hijack"
cask "loopback"
cask "obs"
cask "soundsource"
cask "streamlabs"
{{- end }}

{{- if eq .machine.profile "work" }}
# Work tools (deltatail only)
cask "microsoft-teams"
cask "slack"
{{- end }}

{{- if eq .machine.profile "home" }}
# Home entertainment (crowntail only)
cask "discord"
cask "minecraft"
cask "spotify"
{{- end }}

mas "1Password for Safari", id: 1569813296
mas "Bear", id: 1091189122
mas "DaisyDisk", id: 411643860
mas "Fantastical", id: 975937182
mas "GoLinks", id: 1478821913
mas "Keynote", id: 361285480
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
# mas "Tailscale", id: 1475387142  # Disabled: install manually after setup to avoid password prompts
mas "Whisper", id: 1668083311